{"two": 1105, "hash": 801, "array": 2347, "table": 830, "sum": 594, "easy": 1231, "linked": 83, "recursion": 52, "medium": 2033, "math": 3981, "list": 104, "numbers": 209, "add": 37, "repeating": 11, "substring": 83, "characters": 56, "string": 1129, "sliding": 169, "window": 165, "longest": 126, "without": 16, "arrays": 97, "sorted": 54, "search": 2027, "conquer": 406, "binary": 1899, "divide": 439, "hard": 1207, "median": 30, "pointers": 863, "palindromic": 39, "programming": 644, "dynamic": 640, "conversion": 7, "zigzag": 12, "reverse": 55, "integer": 49, "atoi": 1, "palindrome": 79, "number": 1493, "expression": 61, "regular": 12, "matching": 63, "water": 28, "container": 2, "greedy": 3839, "roman": 6, "trie": 60, "prefix": 288, "common": 46, "sorting": 542, "3sum": 6, "closest": 30, "backtracking": 112, "combinations": 5, "phone": 19, "letter": 28, "4sum": 2, "end": 9, "node": 27, "nth": 6, "remove": 62, "parentheses": 17, "stack": 184, "valid": 64, "merge": 42, "lists": 9, "generate": 21, "priority": 210, "queue": 268, "sort": 159, "heap": 213, "swap": 31, "nodes": 52, "pairs": 114, "k-group": 1, "duplicates": 11, "element": 56, "find": 345, "occurrence": 4, "first": 26, "index": 19, "manipulation": 269, "bit": 283, "integers": 56, "concatenation": 17, "words": 45, "permutation": 175, "next": 17, "rotated": 6, "last": 40, "position": 12, "insert": 11, "sudoku": 2, "matrix": 350, "solver": 2, "count": 256, "say": 3, "combination": 13, "ii": 281, "positive": 15, "missing": 23, "monotonic": 92, "rain": 10, "trapping": 3, "simulation": 199, "strings": 892, "multiply": 8, "wildcard": 2, "jump": 16, "game": 381, "permutations": 63, "image": 6, "rotate": 10, "anagrams": 6, "group": 18, "pow": 2, "n-queens": 2, "subarray": 90, "maximum": 458, "spiral": 7, "intervals": 14, "interval": 18, "word": 56, "length": 63, "sequence": 121, "unique": 51, "paths": 349, "combinatorics": 863, "minimum": 456, "path": 140, "one": 73, "plus": 20, "justification": 1, "text": 12, "sqrt": 1, "stairs": 12, "climbing": 5, "memoization": 42, "simplify": 1, "distance": 83, "edit": 2, "set": 124, "zeroes": 7, "2d": 14, "colors": 13, "subsets": 15, "depth-first": 333, "rectangle": 38, "histogram": 2, "largest": 69, "maximal": 13, "partition": 54, "scramble": 1, "gray": 2, "code": 23, "decode": 13, "ways": 46, "ip": 7, "restore": 16, "addresses": 5, "inorder": 5, "traversal": 22, "tree": 628, "trees": 957, "interleaving": 1, "validate": 4, "recover": 11, "breadth-first": 252, "symmetric": 10, "level": 13, "order": 34, "depth": 6, "construct": 27, "preorder": 12, "postorder": 4, "convert": 32, "balanced": 54, "flatten": 6, "distinct": 50, "subsequences": 66, "right": 18, "populating": 2, "triangle": 38, "pascal": 2, "time": 111, "best": 33, "buy": 18, "sell": 11, "stock": 18, "iii": 49, "ladder": 4, "consecutive": 45, "union-find": 97, "root": 20, "leaf": 12, "regions": 4, "surrounded": 2, "partitioning": 9, "graph": 375, "clone": 4, "theory": 1148, "gas": 3, "station": 4, "candy": 16, "single": 13, "copy": 7, "random": 23, "pointer": 2, "break": 16, "cycle": 22, "reorder": 6, "lru": 2, "doubly-linked": 15, "design": 145, "cache": 3, "insertion": 7, "geometry": 469, "points": 77, "max": 53, "line": 47, "polish": 1, "evaluate": 9, "notation": 7, "product": 83, "min": 19, "upside": 2, "read": 3, "read4": 2, "interactive": 317, "given": 48, "times": 11, "call": 5, "multiple": 14, "intersection": 13, "peak": 7, "ranges": 9, "radix": 4, "bucket": 6, "gap": 4, "compare": 4, "version": 536, "recurring": 1, "fraction": 7, "decimal": 6, "input": 2, "excel": 4, "title": 3, "column": 13, "sheet": 8, "counting": 255, "majority": 13, "structure": 3, "data": 2007, "stream": 28, "trailing": 6, "factorial": 10, "iterator": 9, "dungeon": 8, "combine": 1, "tables": 8, "database": 311, "highest": 15, "salary": 11, "second": 16, "scores": 7, "rank": 14, "earning": 2, "employees": 17, "managers": 2, "duplicate": 15, "emails": 3, "never": 3, "customers": 13, "department": 5, "top": 13, "three": 104, "salaries": 4, "dna": 6, "rolling": 35, "sequences": 41, "repeated": 10, "function": 84, "iv": 21, "bits": 22, "frequency": 37, "shell": 7, "transpose": 2, "file": 13, "tenth": 1, "delete": 26, "rising": 3, "temperature": 2, "house": 16, "robber": 5, "side": 5, "view": 3, "islands": 12, "bitwise": 35, "range": 53, "happy": 17, "elements": 100, "primes": 11, "enumeration": 136, "isomorphic": 3, "course": 6, "topological": 38, "schedule": 13, "implement": 7, "size": 29, "shortest": 375, "kth": 24, "quickselect": 8, "contains": 6, "sweep": 9, "ordered": 81, "indexed": 43, "skyline": 3, "segment": 100, "problem": 214, "square": 81, "complete": 25, "area": 26, "basic": 5, "calculator": 14, "using": 20, "queues": 1, "invert": 2, "summary": 3, "bst": 18, "smallest": 88, "power": 39, "stacks": 4, "digit": 37, "ancestor": 9, "lowest": 8, "self": 4, "except": 1, "different": 26, "anagram": 8, "strobogrammatic": 3, "shifted": 2, "univalue": 2, "subtrees": 8, "vector": 1, "meeting": 20, "rooms": 9, "factor": 7, "verify": 3, "paint": 25, "digits": 68, "smaller": 5, "users": 13, "trips": 5, "ugly": 8, "alien": 3, "dictionary": 9, "value": 77, "encode": 7, "english": 3, "h-index": 2, "fence": 23, "celebrity": 1, "bad": 14, "squares": 37, "perfect": 32, "wiggle": 3, "operators": 3, "move": 17, "peeking": 1, "successor": 2, "walls": 6, "gates": 4, "abbreviation": 6, "life": 16, "pattern": 22, "brainteaser": 20, "nim": 12, "flip": 19, "point": 24, "serialize": 3, "deserialize": 3, "bulls": 4, "cows": 12, "subsequence": 103, "increasing": 62, "invalid": 6, "enclosing": 1, "pixels": 3, "black": 23, "query": 15, "immutable": 4, "additive": 1, "mutable": 2, "cooldown": 1, "height": 15, "multiplication": 20, "sparse": 2, "burst": 2, "balloons": 10, "super": 11, "vertical": 6, "letters": 24, "buildings": 6, "lengths": 4, "bulb": 2, "switcher": 2, "generalized": 1, "create": 15, "coin": 14, "change": 20, "undirected": 3, "components": 15, "connected": 19, "equals": 8, "even": 54, "odd": 47, "patching": 1, "serialization": 2, "eulerian": 4, "reconstruct": 4, "circuit": 6, "itinerary": 1, "subtree": 18, "triplet": 7, "crossing": 3, "weight": 19, "nested": 10, "four": 16, "vowels": 12, "average": 33, "moving": 15, "frequent": 10, "tic-tac-toe": 6, "android": 1, "patterns": 4, "bitmask": 55, "unlock": 3, "disjoint": 5, "snake": 8, "doll": 4, "envelopes": 2, "russian": 2, "twitter": 1, "reflection": 4, "rearrange": 13, "apart": 2, "rate": 7, "logger": 1, "limiter": 1, "transformed": 2, "bomb": 6, "enemy": 4, "hit": 4, "counter": 5, "larger": 2, "jug": 1, "leaves": 10, "divisible": 41, "subset": 22, "addition": 19, "sums": 36, "guess": 34, "higher": 3, "lower": 4, "directory": 1, "getrandom": 2, "randomized": 13, "allowed": 3, "sampling": 9, "reservoir": 4, "ransom": 1, "note": 3, "shuffle": 16, "parser": 4, "mini": 2, "lexicographical": 4, "character": 27, "absolute": 21, "difference": 65, "elimination": 9, "validation": 1, "utf-8": 1, "least": 24, "replacement": 12, "pick": 6, "division": 31, "watch": 9, "frog": 13, "left": 10, "hexadecimal": 4, "reconstruction": 11, "split": 54, "fizz": 2, "buzz": 2, "arithmetic": 22, "slices": 3, "third": 8, "equal": 153, "pacific": 1, "atlantic": 1, "flow": 7, "fitting": 2, "screen": 3, "sentence": 15, "battleships": 1, "board": 19, "password": 21, "checker": 8, "strong": 9, "xor": 126, "original": 8, "doubly": 5, "quad": 1, "n-ary": 10, "multilevel": 1, "genetic": 5, "mutation": 2, "segments": 72, "non-overlapping": 12, "ternary": 77, "k-th": 21, "coins": 31, "arranging": 4, "compression": 12, "boomerangs": 2, "disappeared": 1, "arrows": 2, "moves": 27, "assign": 5, "cookies": 5, "132": 1, "loop": 1, "circular": 28, "pigs": 6, "poor": 1, "lfu": 1, "hamming": 12, "perimeter": 9, "island": 10, "win": 7, "account": 6, "balancing": 6, "optimal": 20, "repetitions": 2, "wraparound": 1, "substrings": 90, "address": 4, "polygon": 22, "convex": 5, "rand10": 1, "rejection": 2, "probability": 11, "statistics": 14, "rand7": 1, "concatenated": 5, "matchsticks": 1, "ones": 30, "heaters": 2, "complement": 4, "total": 38, "circle": 28, "magical": 13, "license": 1, "formatting": 2, "key": 12, "base": 7, "good": 103, "winner": 9, "predict": 2, "zuma": 2, "room": 15, "robot": 55, "cleaner": 5, "maze": 22, "non-decreasing": 12, "target": 47, "teemo": 1, "attacking": 1, "greater": 23, "rectangles": 29, "diagonal": 10, "traverse": 3, "keyboard": 17, "row": 23, "mode": 5, "ipo": 1, "relative": 5, "ranks": 1, "fibonacci": 24, "play": 15, "analysis": 28, "bottom": 1, "trail": 2, "freedom": 3, "machines": 3, "washing": 2, "capital": 6, "detect": 5, "uncommon": 5, "continuous": 11, "deleting": 8, "contiguous": 3, "beautiful": 97, "arrangement": 12, "minesweeper": 4, "lonely": 7, "pixel": 3, "k-diff": 1, "tinyurl": 1, "complex": 4, "01": 5, "diameter": 17, "matches": 5, "contest": 31, "output": 1, "boundary": 7, "boxes": 29, "provinces": 1, "attendance": 3, "record": 2, "student": 12, "wall": 17, "brick": 3, "grids": 2, "represented": 3, "quad-trees": 1, "logical": 2, "tilt": 1, "nesting": 4, "reshape": 4, "vacation": 3, "days": 25, "employee": 11, "direct": 1, "reports": 1, "another": 85, "squirrel": 3, "winning": 7, "candidate": 1, "distribute": 11, "candies": 40, "bonus": 5, "get": 22, "answer": 4, "question": 5, "cumulative": 1, "departments": 3, "unsorted": 3, "kill": 7, "process": 11, "operation": 17, "referee": 2, "customer": 9, "investments": 1, "2016": 1, "placing": 6, "orders": 12, "erect": 2, "in-memory": 1, "system": 39, "validator": 2, "tag": 6, "subtraction": 13, "harmonious": 2, "big": 23, "countries": 2, "classes": 5, "students": 29, "overall": 1, "requests": 7, "acceptance": 1, "friend": 7, "non-negative": 3, "traffic": 11, "human": 4, "stadium": 2, "friends": 41, "available": 4, "seats": 3, "compressed": 4, "place": 13, "flowers": 12, "person": 5, "sales": 13, "judgement": 1, "plane": 11, "degree": 10, "follower": 1, "company": 20, "vs": 17, "bold": 2, "geography": 1, "report": 9, "biggest": 3, "movies": 3, "boring": 8, "task": 39, "scheduler": 3, "factorization": 5, "exchange": 14, "sex": 1, "inverse": 13, "formula": 7, "covering": 8, "derangement": 1, "storage": 4, "log": 7, "exclusive": 1, "functions": 10, "levels": 7, "offers": 1, "shopping": 10, "equation": 16, "solve": 2, "deque": 6, "autocomplete": 2, "mismatch": 3, "chain": 13, "pair": 37, "replace": 26, "dota2": 1, "senate": 1, "keys": 10, "print": 10, "return": 5, "origin": 3, "smoother": 1, "width": 4, "printer": 3, "strange": 49, "trim": 1, "cut": 25, "event": 7, "golf": 1, "off": 4, "magic": 51, "map": 9, "parenthesis": 3, "24": 2, "baseball": 2, "empty": 10, "slots": 1, "connection": 3, "redundant": 3, "match": 10, "chessboard": 12, "knight": 9, "subarrays": 100, "importance": 2, "spell": 6, "stickers": 2, "alternating": 35, "falling": 8, "unknown": 4, "hashset": 1, "hashmap": 1, "case": 12, "blacklist": 1, "ascii": 3, "less": 13, "transaction": 3, "fee": 3, "module": 1, "2-bit": 1, "1-bit": 1, "accounts": 4, "comments": 3, "crush": 1, "pivot": 4, "parts": 6, "atoms": 2, "dividing": 15, "calendar": 17, "fill": 9, "flood": 3, "similarity": 5, "collision": 1, "asteroid": 1, "lisp": 1, "parse": 1, "monotone": 4, "temperatures": 1, "daily": 3, "earn": 5, "pickup": 3, "cherry": 5, "delay": 2, "network": 32, "suffix": 120, "cost": 84, "twice": 5, "others": 1, "completing": 1, "contain": 4, "virus": 4, "corner": 5, "cidr": 1, "lock": 11, "open": 3, "cracking": 4, "safe": 6, "reach": 26, "pour": 2, "pyramid": 3, "transition": 1, "free": 9, "mappings": 1, "special": 589, "prime": 47, "representation": 6, "labels": 3, "sign": 7, "couples": 1, "holding": 1, "hands": 3, "toeplitz": 1, "reorganize": 1, "make": 201, "chunks": 2, "stones": 26, "jewels": 2, "puzzle": 33, "minimize": 41, "local": 10, "inversions": 21, "global": 3, "adjacent": 39, "lr": 1, "swim": 1, "symbol": 2, "grammar": 2, "reaching": 1, "forest": 15, "rabbits": 4, "transform": 11, "bipartite": 8, "stops": 3, "within": 11, "flights": 4, "cheapest": 1, "escape": 14, "ghosts": 3, "domino": 19, "tiling": 7, "tromino": 1, "custom": 3, "preimage": 1, "state": 20, "bounded": 5, "source": 3, "rotation": 7, "score": 79, "tower": 16, "champagne": 1, "color": 24, "rgb": 5, "similar": 1054, "swaps": 36, "states": 13, "eventual": 1, "bricks": 7, "morse": 3, "lines": 13, "write": 3, "increase": 11, "city": 32, "keep": 11, "servings": 1, "soup": 2, "expressive": 1, "chalkboard": 1, "subdomain": 1, "visit": 8, "averages": 3, "pruning": 2, "bus": 23, "routes": 7, "coordinates": 2, "ambiguous": 2, "race": 14, "car": 12, "encoding": 5, "short": 9, "card": 35, "flipping": 12, "factors": 5, "latin": 3, "goat": 1, "appropriate": 2, "ages": 1, "assigning": 4, "profit": 9, "work": 11, "large": 17, "making": 12, "groups": 35, "positions": 9, "personal": 1, "masking": 1, "information": 4, "distances": 9, "overlap": 2, "new": 123, "21": 1, "push": 4, "dominoes": 11, "grid": 92, "backspace": 2, "mountain": 16, "straights": 1, "hand": 2, "visiting": 3, "shifting": 7, "maximize": 71, "rich": 2, "loud": 3, "fleet": 2, "k-similar": 1, "exam": 25, "workers": 2, "hire": 2, "mirror": 16, "buddy": 1, "lemonade": 3, "deepest": 3, "reordered": 1, "advantage": 2, "refueling": 1, "leaf-similar": 1, "walking": 19, "bananas": 3, "koko": 1, "eating": 6, "middle": 10, "stone": 18, "profitable": 5, "schemes": 1, "decoded": 1, "boats": 2, "people": 18, "save": 10, "reachable": 10, "subdivided": 1, "3d": 3, "projection": 2, "shapes": 5, "sentences": 3, "bipartition": 1, "possible": 19, "drop": 6, "egg": 3, "fair": 22, "widths": 1, "surface": 1, "special-equivalent": 1, "full": 9, "ors": 1, "orderly": 1, "rle": 1, "span": 1, "online": 11, "di": 3, "fruit": 2, "baskets": 3, "parity": 18, "palindromes": 20, "minimums": 9, "snakes": 5, "ladders": 2, "election": 3, "mouse": 3, "cat": 17, "cards": 45, "kind": 4, "deck": 8, "inserter": 1, "playlists": 1, "music": 10, "multiplicity": 2, "spread": 5, "malware": 2, "name": 11, "pressed": 1, "long": 27, "email": 4, "recent": 5, "calls": 4, "bridge": 8, "dialer": 1, "stamping": 2, "files": 2, "superstring": 2, "columns": 18, "increment": 6, "removed": 3, "bag": 6, "tokens": 5, "reveal": 1, "equivalent": 7, "component": 10, "verifying": 2, "doubled": 2, "billboard": 1, "tallest": 1, "cells": 16, "prison": 8, "completeness": 1, "check": 72, "slashes": 1, "n-repeated": 1, "2n": 1, "ramp": 1, "express": 3, "univalued": 1, "vowel": 9, "spellchecker": 1, "differences": 13, "cameras": 2, "pancake": 1, "powerful": 4, "rational": 2, "turbulent": 1, "based": 5, "key-value": 1, "store": 9, "triples": 12, "zero": 59, "tickets": 9, "bbb": 1, "aaa": 1, "queries": 117, "intersections": 4, "starting": 2, "array-form": 1, "satisfiability": 2, "equations": 5, "equality": 7, "broken": 14, "cousins": 4, "rotting": 1, "oranges": 6, "flips": 13, "squareful": 1, "judge": 1, "town": 5, "captures": 1, "rook": 4, "illumination": 2, "substitutions": 2, "negations": 1, "clumsy": 1, "rotations": 2, "10": 4, "durations": 1, "60": 1, "songs": 3, "ship": 5, "packages": 2, "capacity": 5, "sightseeing": 1, "representing": 1, "-2": 1, "enclaves": 1, "outermost": 2, "camelcase": 1, "stitching": 1, "video": 7, "divisor": 16, "scheduling": 4, "until": 2, "coloring": 58, "border": 2, "uncrossed": 1, "boomerang": 1, "triangulation": 2, "planting": 3, "flower": 8, "bought": 3, "products": 18, "cooperated": 1, "directors": 1, "actors": 1, "bookstore": 1, "owner": 1, "grumpy": 1, "previous": 3, "distant": 1, "barcodes": 1, "form": 18, "way": 12, "confusing": 2, "campus": 4, "bikes": 4, "rounding": 5, "error": 7, "meet": 3, "lead": 3, "destination": 8, "lexicographically": 27, "fixed": 15, "greatest": 12, "rows": 15, "negabinary": 1, "adding": 8, "submatrices": 8, "project": 9, "bigram": 2, "occurrences": 18, "tile": 2, "possibilities": 1, "insufficient": 1, "five": 6, "high": 7, "expansion": 7, "brace": 2, "zeros": 17, "values": 29, "supersequence": 2, "sample": 1, "pooling": 1, "unpopular": 1, "books": 19, "k-length": 3, "everyone": 7, "moment": 3, "become": 5, "earliest": 8, "labelled": 1, "filling": 7, "bookcase": 2, "shelves": 1, "boolean": 6, "parsing": 40, "defanging": 1, "bookings": 1, "flight": 5, "corporate": 1, "grade": 3, "posts": 4, "reported": 2, "concurrency": 9, "foobar": 1, "alternately": 2, "h2o": 1, "building": 19, "month": 4, "well-performing": 1, "sufficient": 1, "team": 28, "businesses": 1, "active": 8, "user": 7, "platform": 2, "purchase": 6, "armstrong": 1, "cities": 15, "spanning": 13, "connecting": 6, "parallel": 12, "courses": 5, "tribonacci": 2, "n-th": 2, "alphabet": 5, "1-bordered": 1, "30": 2, "activity": 4, "past": 5, "decrease": 5, "snapshot": 1, "chunked": 1, "decomposition": 7, "views": 3, "article": 2, "together": 7, "analyze": 3, "website": 1, "transforms": 1, "year": 92, "day": 24, "dice": 8, "rolls": 2, "market": 6, "formed": 2, "far": 6, "land": 7, "date": 11, "price": 19, "single-row": 1, "sticks": 13, "connect": 7, "distribution": 12, "village": 7, "optimize": 2, "transactions": 10, "dinner": 6, "plate": 3, "delivery": 13, "food": 14, "immediate": 3, "arrangements": 8, "diet": 1, "performance": 5, "plan": 12, "reformat": 5, "week": 4, "deletion": 12, "strictly": 11, "blocking": 4, "k-concatenation": 1, "critical": 3, "connections": 1, "biconnected": 1, "monthly": 2, "winners": 1, "tournament": 23, "multithreaded": 2, "apples": 14, "basket": 2, "many": 14, "put": 5, "build": 21, "blocks": 21, "dependencies": 1, "items": 12, "respecting": 1, "fit": 2, "skiplist": 1, "budget": 5, "percentage": 5, "quality": 4, "football": 13, "bsts": 2, "stepping": 2, "chips": 14, "gold": 7, "king": 16, "attack": 8, "queens": 2, "roll": 3, "dates": 3, "philosophers": 1, "dining": 3, "seat": 5, "airplane": 2, "assignment": 8, "progression": 12, "toss": 2, "chocolate": 17, "straight": 3, "filesystem": 1, "sub-folders": 1, "job": 8, "web": 5, "crawler": 3, "solution": 5, "fewest": 1, "per": 7, "post": 6, "transformation": 32, "leaderboard": 1, "removal": 23, "nice": 13, "selling": 6, "2-row": 1, "closed": 2, "region": 3, "synonymous": 1, "handshakes": 2, "don": 6, "cross": 10, "shift": 12, "contaminated": 1, "box": 21, "location": 2, "recommendations": 5, "page": 3, "communicate": 1, "servers": 8, "suggestions": 1, "stay": 3, "steps": 16, "manager": 9, "hexspeak": 1, "ships": 2, "tac": 1, "tic": 1, "toe": 1, "waste": 2, "ingredients": 1, "burgers": 3, "light": 12, "controlled": 1, "examinations": 1, "subtract": 6, "belong": 1, "threshold": 12, "start": 8, "25": 3, "appearing": 1, "covered": 10, "sequential": 5, "obstacles": 2, "weather": 4, "country": 9, "type": 9, "sets": 25, "mutated": 1, "verbal": 1, "running": 12, "genders": 1, "mapping": 1, "decrypt": 2, "videos": 3, "watched": 1, "run-length": 2, "encoded": 4, "decompress": 2, "block": 10, "even-valued": 1, "grandparent": 1, "echo": 1, "no-zero": 2, "operations": 158, "fingers": 2, "restaurant": 9, "growth": 3, "ads": 3, "69": 1, "vertically": 2, "taps": 2, "garden": 9, "period": 4, "diagonally": 1, "filter": 4, "vegan-friendly": 1, "restaurants": 2, "neighbors": 3, "difficulty": 2, "weakest": 3, "reduce": 6, "half": 4, "splitted": 1, "rating": 11, "movie": 7, "sub-arrays": 3, "angle": 4, "clock": 12, "double": 18, "exist": 1, "tweet": 1, "counts": 3, "taking": 2, "negative": 8, "events": 6, "attended": 3, "participants": 1, "every": 8, "apply": 13, "discount": 6, "containing": 8, "options": 2, "divisors": 26, "trusted": 1, "contacts": 1, "current": 3, "teams": 20, "votes": 2, "decreasing": 11, "prefix-aligned": 1, "inform": 1, "needed": 4, "seconds": 6, "identifier": 1, "id": 3, "corresponding": 1, "lucky": 52, "balance": 23, "amount": 12, "allocation": 3, "cinema": 10, "pizza": 12, "3n": 1, "loss": 4, "gain": 2, "underground": 4, "overlapping": 6, "reducing": 3, "dishes": 3, "non-increasing": 2, "travellers": 1, "entity": 2, "html": 1, "quiet": 1, "exams": 8, "step": 2, "whose": 6, "display": 6, "frogs": 5, "croaking": 1, "comparisons": 2, "exactly": 4, "npv": 1, "splitting": 16, "obtain": 7, "constrained": 4, "shifts": 16, "perform": 4, "leftmost": 2, "kids": 3, "changing": 12, "hats": 3, "wear": 1, "session": 5, "bar": 7, "chart": 3, "away": 4, "places": 2, "diff": 2, "limit": 7, "triplets": 18, "collect": 6, "cutting": 23, "fractions": 7, "simplified": 6, "homework": 15, "doing": 1, "favorite": 14, "companies": 1, "inside": 6, "dartboard": 1, "darts": 2, "occurs": 3, "pseudo-palindromic": 1, "dot": 3, "reversing": 3, "codes": 2, "cuts": 5, "cake": 22, "horizontal": 2, "piece": 3, "having": 3, "balls": 37, "calculate": 13, "strongest": 2, "history": 5, "browser": 3, "shop": 15, "prices": 9, "final": 13, "subrectangle": 3, "mailboxes": 1, "allocate": 1, "1d": 6, "removals": 19, "bouquets": 2, "sold": 1, "names": 5, "avoid": 7, "pseudo-critical": 1, "strongly": 7, "edges": 20, "excluding": 2, "friendly": 4, "streamed": 1, "satisfy": 5, "condition": 4, "sharing": 3, "safely": 1, "invest": 1, "ants": 6, "plank": 1, "fall": 3, "1s": 2, "service": 5, "centre": 1, "sub-tree": 2, "e-mails": 1, "bottles": 5, "label": 2, "mysterious": 13, "increments": 9, "patients": 2, "arrange": 3, "hidden": 16, "insertions": 2, "awesome": 2, "fix": 7, "format": 2, "great": 25, "stick": 4, "odds": 4, "magnetic": 2, "force": 1930, "eat": 8, "differ": 2, "bank": 10, "thousand": 2, "separator": 2, "vertices": 9, "cycles": 6, "sector": 1, "visited": 5, "track": 5, "latest": 7, "warehouse": 4, "disconnect": 2, "vectors": 3, "colorful": 25, "rope": 3, "traversable": 1, "fully": 1, "unhappy": 1, "transformable": 1, "obtained": 3, "spaces": 3, "non": 5, "frequently": 1, "infix": 1, "folder": 2, "wheel": 2, "centennial": 1, "operating": 1, "throne": 1, "inheritance": 1, "achievable": 2, "transfer": 3, "nearest": 14, "parking": 7, "alert": 1, "key-card": 1, "hour": 2, "handled": 1, "sellers": 3, "visible": 5, "ids": 2, "font": 1, "mean": 8, "removing": 22, "coordinate": 4, "fancy": 8, "represent": 2, "applying": 5, "conflicts": 1, "connectivity": 4, "slowest": 1, "effort": 1, "polynomials": 6, "hopper": 3, "widest": 2, "formation": 4, "furthest": 3, "instructions": 6, "generated": 2, "deletions": 15, "frequencies": 4, "colored": 18, "diminishing-valued": 1, "defuse": 1, "home": 12, "jumps": 13, "close": 4, "determine": 11, "happiness": 6, "correct": 6, "machine": 14, "numeric": 2, "energy": 7, "tasks": 11, "initial": 4, "finish": 8, "front": 1, "back": 19, "richest": 2, "wealth": 1, "competitive": 3, "complementary": 3, "deviation": 2, "invoices": 1, "worth": 1, "goal": 2, "interpretation": 1, "k-sum": 2, "incompatibility": 1, "tweets": 2, "consistent": 2, "vi": 2, "ports": 1, "delivering": 2, "deci-binary": 1, "vii": 2, "stacking": 1, "cuboids": 1, "partners": 1, "leads": 1, "erasure": 1, "checking": 5, "edge": 24, "existence": 5, "limited": 5, "persons": 1, "lunch": 3, "unable": 1, "waiting": 4, "halves": 1, "alike": 1, "eaten": 1, "ball": 17, "visits": 2, "units": 2, "truck": 1, "meals": 2, "evenly-spaced": 1, "leetcode": 1, "money": 11, "xored": 2, "swapping": 8, "jobs": 2, "tuple": 1, "submatrix": 5, "rearrangements": 1, "followers": 2, "altitude": 1, "teach": 3, "replacing": 9, "conditions": 6, "spent": 2, "leetflex": 1, "banned": 1, "ends": 6, "recently": 1, "used": 3, "fat": 2, "recyclable": 1, "low": 4, "changes": 8, "homogenous": 1, "trio": 1, "ocean": 1, "concatenating": 2, "coprimes": 1, "subtasks": 1, "execute": 2, "performing": 7, "popularity": 3, "features": 2, "rule": 2, "dessert": 2, "powers": 19, "beauty": 19, "slam": 1, "titles": 2, "grand": 3, "restricted": 3, "primary": 2, "star": 9, "center": 7, "ratio": 3, "pass": 5, "authentication": 1, "ascending": 3, "backlog": 1, "reinitialize": 1, "bracket": 31, "sessions": 3, "ad-free": 1, "candidates": 4, "interview": 6, "getting": 6, "donuts": 1, "fresh": 1, "truncate": 1, "finding": 16, "minutes": 2, "gcds": 5, "accepted": 2, "invitations": 1, "revenue": 1, "sideway": 1, "mk": 1, "sensor": 1, "faulty": 2, "pangram": 2, "cream": 8, "ice": 15, "bars": 4, "single-threaded": 1, "cpu": 1, "league": 12, "suspicious": 3, "reservation": 1, "rearranging": 3, "descending": 1, "include": 1, "population": 2, "min-product": 1, "directed": 7, "prefixes": 18, "memory": 15, "leak": 1, "incremental": 4, "rotating": 3, "floored": 1, "totals": 1, "certain": 4, "quantity": 4, "longer": 1, "arrive": 3, "speed": 2, "viii": 2, "rhombus": 3, "summation": 5, "skips": 1, "eggs": 3, "floors": 2, "whether": 2, "reduction": 7, "wasted": 3, "packaging": 1, "space": 14, "2020": 1, "login": 3, "ribbons": 1, "chalk": 1, "redistribute": 1, "removable": 1, "players": 7, "compete": 1, "rounds": 5, "played": 2, "sub": 1, "categories": 2, "rental": 1, "cyclically": 1, "wonderful": 16, "ant": 5, "colony": 5, "leetcodify": 2, "monsters": 19, "eliminate": 2, "subpath": 1, "entrance": 2, "exit": 1, "length-3": 1, "painting": 26, "decomposable": 1, "value-equal": 1, "confirmation": 2, "rungs": 1, "request": 3, "actively": 1, "messages": 8, "unoccupied": 1, "chair": 1, "describe": 1, "mutating": 1, "compatibility": 1, "folders": 1, "friendship": 2, "weeks": 1, "enough": 4, "variants": 1, "legal": 1, "resizing": 1, "obstacle": 4, "searchable": 1, "appear": 3, "non-zero": 7, "still": 1, "exists": 4, "descendants": 1, "typewriter": 3, "separate": 6, "chosen": 1, "indices": 24, "cutoff": 1, "school": 12, "caught": 1, "experiments": 1, "farmland": 1, "quadruplets": 2, "weak": 5, "gcd": 55, "made": 3, "interchangeable": 1, "seniors": 2, "juniors": 2, "join": 4, "earnings": 3, "taxi": 7, "variable": 5, "crossword": 7, "placed": 1, "solving": 6, "street": 5, "brightest": 1, "confusion": 2, "low-quality": 1, "problems": 12, "observations": 1, "ix": 2, "uni-value": 1, "fluctuation": 1, "pieces": 9, "idle": 1, "becomes": 1, "interviews": 1, "simple": 26, "bitwise-or": 1, "already": 1, "numerically": 1, "category": 2, "member": 2, "plates": 4, "candles": 2, "cleaning": 9, "cleaned": 1, "distributed": 3, "minimized": 1, "almost": 31, "item": 3, "university": 7, "slanted": 1, "ciphertext": 1, "houses": 12, "plants": 3, "watering": 6, "k-mirror": 1, "begin": 1, "buckets": 2, "hamsters": 3, "feed": 6, "homecoming": 2, "pyramids": 2, "fertile": 1, "radius": 2, "secret": 17, "discounts": 7, "3-digit": 2, "directions": 5, "step-by-step": 1, "rob": 1, "detonate": 1, "bombs": 4, "ordinal": 1, "sequentially": 1, "tracker": 6, "rods": 1, "rings": 2, "fruits": 10, "harvested": 1, "flavors": 1, "smooth": 4, "periods": 4, "descent": 1, "k-increasing": 1, "airport": 2, "found": 2, "recipes": 1, "supplies": 1, "abbreviating": 1, "reversal": 5, "staying": 1, "execution": 2, "identical": 4, "appears": 2, "laser": 7, "beams": 2, "asteroids": 1, "destroying": 5, "invited": 1, "capitalize": 1, "twin": 6, "bloom": 4, "questions": 8, "brainpower": 1, "computers": 2, "passengers": 2, "choose": 12, "buying": 15, "ranked": 1, "corridor": 4, "statements": 1, "cover": 13, "multiplying": 1, "divisions": 2, "painted": 2, "independently": 2, "according": 2, "cooking": 3, "rearranged": 4, "bitset": 3, "cars": 8, "goods": 2, "illegal": 1, "beans": 2, "streak": 3, "rankings": 1, "repeat": 3, "sturdy": 1, "following": 3, "jumbled": 2, "acyclic": 3, "ancestors": 2, "minimal": 17, "append": 3, "descriptions": 1, "non-coprime": 3, "topic": 1, "k-distant": 1, "extracted": 1, "artifacts": 2, "topmost": 1, "required": 8, "subgraph": 4, "weighted": 10, "eligible": 3, "halve": 2, "tiles": 10, "white": 15, "carpets": 1, "hills": 4, "valleys": 3, "road": 27, "collisions": 8, "archery": 2, "competition": 13, "health": 1, "beat": 2, "piles": 4, "triangular": 3, "select": 5, "built": 2, "losses": 1, "children": 12, "allocated": 1, "encrypt": 1, "purchases": 4, "seven": 2, "result": 4, "gardens": 1, "brightness": 2, "driver": 2, "passenger": 2, "pens": 3, "pencils": 3, "atm": 3, "cornered": 1, "trip": 15, "highways": 2, "lattice": 3, "pivoting": 1, "unpivoting": 1, "unguarded": 1, "fire": 10, "spreading": 1, "appeal": 1, "3-same-digit": 1, "texts": 1, "keypresses": 1, "k-beauty": 1, "carpet": 4, "variance": 2, "resultant": 1, "bags": 13, "rocks": 3, "strength": 5, "wizards": 11, "seen": 1, "sender": 1, "roads": 26, "concert": 2, "booking": 3, "stocks": 2, "trading": 6, "years": 4, "editor": 7, "weekend": 1, "spells": 5, "potions": 8, "successful": 1, "paid": 1, "taxes": 2, "naming": 4, "contradictions": 1, "gender": 1, "upper": 2, "wood": 1, "recorded": 1, "asterisks": 2, "unreachable": 1, "x-matrix": 1, "spliced": 1, "message": 14, "aware": 1, "catch": 8, "squared": 1, "varying": 2, "cups": 2, "infinite": 22, "ideal": 5, "trimmed": 1, "mountains": 5, "compute": 4, "poker": 5, "zero-filled": 1, "impossible": 3, "excellent": 2, "take": 7, "taught": 1, "subjects": 1, "teacher": 6, "amounts": 2, "subtracting": 1, "entering": 2, "costs": 2, "train": 16, "invoice": 1, "replacements": 3, "restrictions": 4, "salesperson": 1, "influence": 1, "olympic": 4, "recolors": 1, "hours": 2, "training": 13, "infected": 2, "wise": 5, "null": 3, "stars": 11, "garbage": 2, "deductions": 1, "robots": 15, "sql": 1, "trainers": 1, "alphabetical": 2, "turn": 7, "equalize": 18, "uploaded": 1, "pairings": 1, "inequality": 5, "satisfying": 3, "hourglass": 2, "purchased": 1, "tastiness": 3, "worked": 1, "bounds": 2, "conflict": 1, "edits": 1, "targets": 1, "destroy": 3, "popular": 1, "creator": 1, "traveled": 3, "lcm": 20, "unequal": 8, "fuel": 2, "partitions": 10, "bond": 1, "chemical": 2, "penalty": 2, "skill": 3, "hall": 3, "allocator": 1, "concatenate": 6, "profession": 1, "degrees": 2, "captured": 1, "forts": 1, "reward": 3, "k-big": 1, "criteria": 1, "categorize": 1, "xor-beauty": 1, "powered": 2, "taken": 2, "door": 7, "monkeys": 1, "marbles": 8, "gifts": 12, "pile": 4, "remapping": 1, "handling": 1, "update": 6, "summing": 2, "square-free": 3, "lcp": 5, "divisibility": 18, "marked": 3, "cell": 3, "pillow": 1, "coprime": 8, "todo": 1, "greatness": 1, "marking": 1, "repair": 4, "configuration": 2, "tour": 11, "grains": 1, "k-subarray": 1, "mice": 6, "cheese": 5, "class": 14, "object": 11, "instance": 1, "prototype": 2, "sleep": 7, "memoize": 2, "snail": 2, "deeply": 1, "debounce": 1, "json": 3, "deep": 6, "composition": 5, "curry": 1, "pool": 6, "promise": 4, "k-free": 1, "additions": 2, "red": 15, "generator": 12, "cancellable": 1, "delayed": 1, "arrival": 2, "multiples": 8, "uncovered": 1, "fish": 6, "bowling": 5, "completely": 2, "allow": 1, "hello": 2, "world": 25, "spotify": 1, "artist": 1, "ranking": 6, "objects": 3, "throttle": 1, "chunk": 1, "senior": 1, "citizens": 1, "heroes": 7, "losers": 1, "neighboring": 1, "extract": 2, "method": 3, "helper": 2, "immutability": 1, "context": 3, "emitter": 1, "wrapper": 1, "punishment": 2, "modify": 3, "weights": 12, "non-positive": 1, "passed": 1, "arguments": 2, "compact": 1, "chocolates": 5, "extra": 5, "diagonals": 3, "hops": 1, "cancellation": 3, "timeout": 1, "semi-ordered": 1, "asynchronous": 1, "promises": 3, "chaining": 2, "fascinating": 1, "semi-repetitive": 1, "movement": 4, "neither": 2, "collecting": 6, "decremental": 1, "bind": 1, "batching": 1, "imbalance": 5, "relocate": 1, "bound": 1, "undefined": 1, "callback": 1, "occupancy": 1, "waitlist": 1, "status": 1, "results": 3, "retrieval": 1, "individual": 1, "partial": 6, "placeholders": 1, "met": 1, "foreach": 1, "rounded": 1, "safest": 1, "elegance": 1, "drowning": 1, "takes": 3, "constraint": 3, "resolution": 1, "inversion": 14, "cyclic": 21, "acronym": 1, "k-avoiding": 1, "salesman": 5, "passing": 3, "k-subsequences": 1, "interesting": 23, "equilibrium": 6, "intersect": 1, "remoteness": 1, "reversals": 5, "alloys": 1, "element-sum": 1, "semi-decreasing": 1, "towers": 24, "wording": 1, "k-divisible": 2, "dataframe": 2, "rename": 1, "melt": 1, "minimizing": 6, "non-divisible": 1, "processing": 4, "linear": 6, "sub-multisets": 1, "semi-palindromes": 1, "k-or": 1, "champion": 4, "among": 5, "spending": 1, "high-access": 1, "alice": 27, "bob": 14, "gcd-sum": 1, "hole": 3, "peaks": 3, "added": 3, "infection": 2, "same-end": 1, "almost-equal": 1, "branches": 1, "closing": 5, "devices": 1, "tested": 2, "test": 22, "exponentiation": 3, "modular": 9, "equalindromic": 1, "incremovable": 2, "fences": 1, "field": 15, "expensive": 4, "thrice": 2, "rearrangement": 4, "calling": 2, "types": 4, "loan": 1, "wineries": 1, "self-divisible": 1, "friday": 4, "streamers": 1, "viewers": 1, "turned": 1, "capture": 2, "queen": 5, "pushes": 2, "processed": 1, "playing": 20, "remaining": 3, "revert": 2, "modification": 4, "mark": 12, "toppings": 1, "scientist": 2, "triangles": 19, "classifying": 1, "percentile": 1, "fraud": 1, "snaps": 1, "mutual": 1, "domains": 1, "activities": 2, "exceed": 3, "connectable": 1, "top-left": 1, "redistribution": 2, "apple": 10, "selected": 1, "alphanumerical": 1, "encrypted": 3, "marks": 6, "ending": 1, "k-special": 2, "hashtags": 3, "trending": 2, "anti-palindrome": 1, "bursty": 1, "behavior": 2, "harshad": 1, "manhattan": 8, "self-contained": 1, "walk": 17, "disappearing": 2, "denomination": 1, "potholes": 1, "makes": 2, "server": 1, "utilization": 1, "stable": 8, "uniqueness": 3, "k-periodic": 3, "satisfies": 1, "mystic": 3, "stair": 2, "upgradable": 1, "duration": 3, "concurrent": 1, "placement": 3, "non-adjacent": 1, "fees": 1, "better": 1, "chairs": 2, "meetings": 3, "verification": 2, "clear": 6, "games": 291, "player": 2, "child": 9, "scoring": 4, "casting": 1, "damage": 5, "peaceful": 2, "merging": 11, "permissions": 1, "hopping": 3, "battles": 1, "present": 10, "purchasing": 1, "won": 1, "dominant": 4, "subordinate": 1, "hierarchy": 3, "ceo": 1, "tab": 2, "alt": 2, "neighbor": 2, "premier": 3, "k-size": 2, "rooks": 9, "k-constraint": 2, "boost": 1, "drinks": 4, "constructing": 6, "divided": 1, "dealt": 1, "occupied": 1, "pistons": 1, "pawns": 4, "digitville": 1, "sneaky": 1, "spam": 1, "consonants": 2, "methods": 1, "layout": 1, "k-long": 2, "x-sum": 3, "inserting": 2, "appeared": 1, "k-frequency": 2, "dfs": 1041, "typed": 2, "sizes": 2, "tourist": 5, "transformations": 2, "k-even": 1, "sized": 1, "detection": 3, "k-reducible": 1, "ratings": 3, "collected": 1, "capitalization": 3, "identify": 2, "outlier": 1, "locks": 3, "constraints": 8, "runes": 1, "cast": 1, "success": 2, "dominance": 1, "button": 4, "conversions": 1, "splits": 4, "tracking": 2, "layer": 2, "efficient": 1, "sections": 2, "gift": 15, "chains": 3, "skip": 1, "improved": 2, "nums": 1, "unlocked": 1, "mentions": 1, "supersequences": 2, "reschedule": 2, "caption": 2, "bench": 2, "pizzas": 2, "v-shaped": 1, "serial": 3, "collection": 5, "recognition": 1, "conflicting": 1, "organization": 4, "spreadsheet": 3, "containers": 2, "properties": 1, "brew": 1, "subscription": 1, "trade": 2, "section": 2, "strains": 1, "bacterial": 2, "router": 1, "recommendation": 2, "response": 1, "unit": 3, "dag": 4, "travel": 11, "consonant": 1, "k-edge": 1, "teleportation": 3, "intersecting": 2, "transportation": 4, "resulting": 1, "seasonal": 1, "clean": 1, "classroom": 4, "copies": 1, "picking": 5, "computer": 15, "unlocking": 1, "max-min": 1, "improving": 1, "consistently": 1, "covid": 1, "recovery": 9, "alternate": 1, "prime-gap": 1, "transport": 3, "individuals": 1, "stability": 3, "upgrades": 1, "efficiency": 2, "drivers": 3, "hexatrigesimal": 1, "coupon": 1, "maintenance": 3, "overbooked": 1, "study": 1, "pathways": 1, "popcount-depth": 2, "trapezoids": 2, "inventory": 3, "stores": 1, "via": 3, "exploitability": 1, "threats": 1, "severity": 1, "rides": 3, "trionic": 2, "shipments": 1, "activate": 1, "semi-repeating": 1, "opinions": 1, "polarized": 1, "activation": 1, "sensors": 2, "teleportations": 1, "strategy": 3, "loyal": 1, "k-distinct": 1, "destroyed": 1, "two-letter": 1, "twisted": 2, "finishing": 1, "k-factor": 1, "modes": 2, "zombie": 1, "bowl": 1, "absent": 2, "discards": 1, "capping": 2, "late": 2, "library": 8, "k-balanced": 1, "golden": 7, "churn": 1, "risk": 1, "interior": 1, "calories": 1, "burnt": 1, "deliveries": 1, "expanded": 2, "expressions": 1, "waviness": 2, "negated": 1, "effective": 2, "choosing": 15, "runs": 4, "forbidden": 6, "interaction": 1, "endpoints": 1, "acquire": 1, "all-ones": 1, "token": 2, "usage": 1, "climb": 1, "rectangular": 5, "sheets": 1, "residue": 1, "centered": 1, "caesar": 4, "cipher": 10, "emotionally": 1, "toggles": 1, "vowel-consonant": 1, "auction": 5, "pythagorean": 4, "management": 5, "graphs": 1195, "grail": 1, "dp": 2416, "implementation": 2980, "sortings": 1208, "monster": 11, "structures": 2027, "brute": 1929, "dbmb": 1, "constructive": 2026, "reordering": 1, "mex": 51, "algorithms": 2026, "determinant": 3, "bitmasks": 677, "vertex": 5, "probabilities": 265, "prufer": 1, "dsu": 399, "comparable": 1, "sub-rbs": 2, "zhora": 1, "vacuum": 3, "wins": 4, "little": 58, "xor-convenience": 1, "convenience": 1, "curse": 4, "battlecows": 2, "mixing": 3, "mexes": 1, "robotic": 1, "rush": 6, "outofmemoryerror": 1, "nastiness": 1, "exquisite": 1, "unfair": 4, "huge": 5, "social": 9, "experiment": 3, "minimise": 3, "jumping": 15, "man": 7, "master": 10, "legendary": 2, "war": 3, "yet": 52, "garland": 12, "reindeer": 3, "christmas": 9, "decoration": 2, "production": 1, "snowmen": 2, "medical": 1, "llm": 1, "knit": 1, "matrices": 141, "2-sat": 41, "jackpot": 1, "jinx": 1, "interlock": 1, "irrigation": 2, "honey": 2, "greta": 1, "fragmented": 1, "against": 6, "humanity": 1, "elevator": 8, "doorway": 1, "classification": 8, "cacti": 2, "battle": 15, "bug": 6, "feature": 2, "conditional": 3, "unconditional": 1, "control": 10, "effect": 3, "insolvable": 1, "disks": 2, "xor-factorization": 1, "ashmal": 1, "carnival": 1, "blackslex": 8, "migration": 1, "penguin": 11, "girls": 2, "civilization": 3, "showering": 2, "fireworks": 4, "hashing": 237, "dech": 1, "dations": 1, "hysteria": 1, "xmas": 1, "impost": 1, "sus": 1, "yes": 2, "omega": 1, "fairy": 3, "mosaic": 3, "fft": 108, "chinese": 23, "remainder": 31, "theorem": 27, "scientists": 3, "wishing": 1, "haystack": 1, "needle": 2, "thresholds": 1, "isla": 1, "duel": 6, "shiro": 1, "carry": 2, "taiga": 1, "kanade": 2, "niko": 1, "tactical": 1, "sleeping": 3, "kingdom": 17, "port": 1, "kindergarten": 3, "birthday": 24, "shuffling": 7, "68": 1, "gene": 1, "computing": 3, "cluster": 2, "circles": 8, "buses": 6, "art": 5, "shiori": 1, "miyagi": 1, "sakura": 1, "adachi": 1, "taylor": 2, "rae": 2, "anisphia": 1, "wynn": 1, "palettia": 1, "amaori": 2, "renako": 2, "koito": 1, "yuu": 1, "hoshikawa": 1, "legs": 3, "farm": 6, "shizuku": 1, "quotient": 1, "neighborhood": 2, "selection": 7, "drifting": 1, "intercepting": 1, "butterflies": 1, "locate": 1, "mukhammadali": 1, "loves": 35, "khba": 1, "wand": 1, "isamatdin": 1, "acquisition": 1, "arctic": 1, "rainbow": 8, "branch": 1, "matchings": 102, "wine": 5, "council": 2, "marble": 2, "palindromepalindrome": 1, "pointless": 1, "journey": 14, "modulo": 13, "plegma": 1, "diadrash": 2, "monopati": 1, "ta": 1, "siga": 1, "kymata": 1, "kalamaki": 1, "souvlaki": 1, "schedules": 14, "submst": 1, "always": 1, "locked": 1, "loyalty": 1, "round": 23, "finale": 4, "meet-in-the-middle": 52, "super-short-polynomial-san": 1, "mad": 6, "sink": 1, "annoying": 2, "suspension": 1, "hyper": 3, "bros": 1, "smawk": 1, "keygen": 1, "isaac": 2, "git": 1, "gud": 1, "drones": 1, "adjusting": 1, "billion": 2, "meximum": 2, "whiteboard": 2, "juan": 1, "yuyu": 1, "mimo": 1, "batteries": 2, "capes": 1, "ancient": 14, "abraham": 1, "el": 3, "fucho": 1, "bombing": 3, "mind": 6, "think": 1, "catshock": 1, "notelock": 1, "alone": 1, "symmetrical": 2, "polygons": 4, "reversion": 1, "victorious": 2, "jungle": 1, "triple": 10, "versus": 3, "catching": 2, "krug": 1, "smash": 1, "fun": 21, "attraction": 2, "edition": 15, "buratsuta": 1, "clearing": 3, "nezuko": 1, "knowledge": 2, "ancients": 1, "rose": 2, "unconventional": 1, "farmer": 6, "wish": 4, "john": 5, "falls": 1, "gravity": 2, "dandelion": 1, "fields": 2, "destruction": 9, "pacer": 1, "lasers": 2, "sublime": 1, "maxflow": 2, "flows": 160, "tetration": 1, "popcount": 1, "construction": 20, "bubble": 5, "wrong": 14, "predicting": 1, "monocarp": 5, "nephews": 1, "looking": 5, "difficult": 4, "tags": 2, "non-descending": 1, "furniture": 1, "minimisation": 1, "gaming": 4, "thesis": 1, "cruel": 1, "ultimate": 5, "maple": 3, "builder": 1, "ode": 2, "antiamuny": 2, "slider": 1, "learn": 7, "wants": 1, "cry": 2, "river": 2, "invariance": 2, "mexification": 1, "conjecture": 3, "collatz": 2, "like": 3, "dream": 3, "infinity": 5, "beyond": 3, "oddness": 1, "flint": 4, "steel": 2, "mines": 2, "yearned": 1, "jockey": 1, "chicken": 3, "nether": 1, "villagers": 1, "redstone": 1, "choreographer": 1, "famous": 1, "chamomile": 1, "valley": 2, "rada": 1, "arithmetics": 1, "cunning": 3, "seller": 3, "sea": 7, "wafu": 1, "unjust": 1, "arboris": 1, "contractio": 1, "series": 4, "lever": 3, "pathless": 1, "submission": 2, "top-k": 2, "induced": 1, "blackhole": 1, "rbs": 8, "perspective": 1, "strict": 3, "submedians": 2, "lds": 1, "below": 4, "recycling": 2, "rises": 2, "23": 3, "inter": 2, "aghabalasar": 1, "hamed": 1, "love": 16, "destiny": 2, "haaamid": 1, "hamiiid": 1, "hamid": 1, "mix": 2, "1-1-1": 1, "unlucky": 3, "g-c-d": 1, "definitely": 2, "casino": 4, "timofey": 8, "docker": 1, "lexicographic": 1, "maximise": 2, "appending": 3, "deranged": 1, "blackboard": 5, "lights": 8, "baby": 5, "gangsta": 1, "yamakasi": 1, "sponsor": 2, "1709": 1, "clouds": 2, "superb": 1, "lanes": 1, "divine": 2, "eruptions": 1, "volcanic": 1, "green": 5, "incessant": 1, "omg": 1, "wildflower": 1, "lost": 16, "soul": 2, "retaliation": 1, "cool": 6, "shrink": 1, "false": 1, "alarm": 6, "breath": 1, "gellyfish": 9, "pansy": 1, "tricolor": 2, "radiata": 2, "lycoris": 2, "mayflower": 1, "forget-me-not": 1, "eternal": 3, "violet": 1, "camellia": 1, "japonica": 1, "flaming": 1, "peony": 1, "small": 10, "attacks": 2, "kirei": 2, "estate": 1, "come": 2, "closer": 1, "quite": 3, "kazan": 1, "cheater": 3, "smilo": 2, "minecraft": 4, "shashliks": 1, "variables": 3, "colorings": 3, "reachability": 3, "shrinking": 4, "creating": 5, "cubes": 17, "crystals": 1, "faculty": 2, "melody": 1, "fewer": 1, "racing": 2, "brackets": 16, "fashionable": 1, "wowee": 1, "hacking": 5, "slice": 1, "survive": 2, "fallen": 2, "dispute": 2, "spruce": 3, "numstack": 1, "neo": 1, "sumdamental": 1, "warm-up": 1, "cycling": 3, "ain": 1, "traversing": 1, "lrc": 1, "vip": 1, "baudelaire": 2, "goblin": 1, "wolf": 1, "boy": 5, "st": 1, "chroma": 1, "tc": 1, "dr": 2, "unpleasant": 1, "decks": 2, "picky": 1, "shoo": 1, "sunshine": 1, "shatters": 1, "kia": 1, "bakes": 1, "mani": 1, "quartet": 1, "apartment": 3, "sasha": 20, "vadim": 1, "luggage": 1, "snowdrift": 1, "bermuda": 1, "claim": 1, "baggage": 1, "sports": 4, "betting": 2, "guessing": 9, "impostors": 3, "bears": 4, "teddy": 1, "lightbulbs": 2, "gloves": 1, "premiere": 1, "script": 4, "blurry": 1, "vision": 2, "bl": 1, "am": 1, "unrated": 1, "plinko": 1, "piecing": 1, "saturnita": 1, "saturno": 1, "vaca": 1, "la": 1, "chimpanzini": 1, "bananini": 1, "trulimero": 1, "trulicina": 1, "ambalabu": 1, "boneca": 1, "sahur": 1, "tung": 1, "patapim": 1, "brrr": 1, "brr": 1, "bandito": 1, "bobritto": 1, "troppi": 1, "trippi": 1, "shorten": 1, "hackers": 1, "networks": 1, "neural": 3, "skibidi": 1, "repetition": 3, "ccb": 1, "andryusha": 4, "knows": 1, "mishkin": 1, "energizer": 1, "mosquitoes": 2, "asuna": 1, "lady": 3, "kamilka": 1, "sheep": 4, "boating": 1, "gleb": 2, "igor": 5, "olympiad": 12, "pushing": 2, "hunt": 19, "treasure": 27, "collapse": 3, "canteen": 2, "hamiltonian": 4, "esports": 1, "berland": 41, "upgrade": 3, "weapon": 1, "uppercase": 1, "lowercase": 1, "showmatch": 1, "zebra-like": 1, "jam": 3, "cloudberry": 1, "serval": 19, "buffet": 2, "kaitenzushi": 1, "nediam": 1, "turtle": 25, "satellite": 2, "upon": 2, "skyscape": 1, "blossom": 1, "permafrost": 1, "arcology": 1, "soared": 1, "grace": 3, "afar": 1, "mod": 11, "floor": 7, "ceil": 2, "hot": 8, "quantifier": 2, "mst": 10, "quaternary": 1, "runner": 2, "strikes": 9, "cute": 3, "harmful": 1, "dreaming": 2, "exercise": 6, "ad": 3, "scammy": 1, "vicious": 2, "labyrinth": 8, "verdict": 1, "folding": 4, "strip": 8, "breach": 1, "faith": 1, "returns": 1, "equalization": 2, "recoloring": 4, "season": 4, "necessary": 1, "draw": 4, "boarding": 1, "book": 16, "gathering": 2, "sharks": 1, "lilies": 1, "roses": 2, "corrupted": 2, "hold": 1, "operator": 2, "minus": 7, "hanoi": 3, "cactus": 15, "embedding": 3, "three-dimensional": 2, "300": 1, "ve": 1, "calculated": 1, "goodbye": 2, "banker": 1, "two-hit": 1, "hero": 7, "multi-target": 1, "handle": 2, "couldn": 1, "storages": 2, "main": 2, "goblins": 2, "treasurer": 1, "help": 17, "deceive": 1, "towering": 1, "leafall": 1, "trapmigiano": 1, "reggiano": 1, "perfecto": 1, "repainting": 2, "program": 7, "remixed": 1, "fizzbuzz": 1, "inclusion": 1, "ab": 5, "ba": 1, "strangers": 1, "amusement": 4, "park": 9, "tasting": 3, "pinball": 2, "statues": 2, "hike": 2, "mascot": 1, "benfica": 1, "porto": 1, "planning": 6, "urban": 1, "condorcet": 1, "elections": 13, "devyatkino": 1, "tropical": 1, "aircraft": 2, "builders": 2, "club": 8, "young": 7, "slides": 1, "identification": 1, "thinks": 1, "bro": 1, "skibidus": 8, "slay": 2, "rizz": 1, "sigma": 1, "fanum": 2, "tax": 2, "ohio": 1, "amog": 1, "sand": 5, "mycraft": 1, "discouraged": 1, "variety": 2, "brogramming": 1, "galaxy": 2, "factory": 8, "traveling": 7, "salescat": 1, "cirno": 2, "clockwork": 2, "kevin": 23, "nivek": 1, "bugged": 1, "multiplicative": 1, "mathletes": 1, "fibonacciness": 1, "stop": 5, "milya": 1, "coffee": 7, "gorilla": 2, "shape": 3, "cosmic": 3, "haystacks": 1, "scarecrow": 1, "crafting": 1, "affectionate": 2, "delicate": 1, "anti-monotonous": 1, "naive": 2, "earnest": 1, "caterpillar": 4, "resourceful": 1, "refined": 1, "optimality": 2, "bewitching": 1, "stargazer": 1, "outstanding": 1, "impressionist": 1, "carpenter": 1, "tender": 1, "managing": 2, "screensaver": 1, "legacy": 2, "unknowns": 1, "knowns": 1, "judicious": 1, "watching": 3, "incompetent": 1, "guy": 3, "hoglins": 1, "hunting": 3, "hogwarts": 1, "geometric": 4, "flooded": 1, "correction": 2, "bridges": 8, "bitbitjump": 1, "adrenaline": 1, "joker": 4, "preparing": 6, "maximization": 6, "digital": 12, "uninteresting": 1, "transfusion": 1, "breaks": 2, "mania": 2, "esc": 1, "pspspsps": 1, "memories": 1, "jigsaw": 2, "alyona": 13, "cuneiform": 2, "yandex": 2, "cheops": 2, "emperor": 2, "adventurers": 1, "buggy": 4, "gcddcg": 1, "xorderable": 1, "microwavable": 1, "separators": 1, "aura": 1, "3-angle": 1, "passageway": 1, "narrower": 1, "dragon": 6, "aquatic": 1, "saraga": 1, "icpc": 4, "scrambled": 2, "scrabble": 1, "demon": 4, "insane": 1, "harder": 5, "normal": 1, "fishing": 1, "railway": 7, "castle": 5, "trophic": 1, "species": 1, "bottle": 2, "auto": 1, "segmentation": 1, "folds": 1, "drunken": 1, "cube": 9, "frame": 1, "bento": 1, "adventure": 3, "randomness": 1, "shohag": 9, "pebae": 1, "fixing": 6, "royal": 5, "flush": 1, "renovation": 2, "polyathlon": 1, "galactic": 1, "alternative": 3, "platforms": 5, "barrels": 4, "diy": 4, "exploring": 1, "natlan": 1, "ardent": 1, "flames": 1, "kachina": 1, "surfing": 1, "sharky": 1, "superultra": 1, "inputs": 1, "intercepted": 2, "3000": 2, "xorificator": 2, "rivers": 1, "1543": 1, "anya": 6, "1100": 1, "startup": 2, "quintomania": 1, "forces": 2, "productivity": 1, "go": 7, "real": 3, "alya": 1, "tres": 1, "rayan": 1, "rayaneh": 1, "simurgh": 2, "khayyam": 2, "decree": 2, "harmony": 4, "wisdom": 2, "darius": 1, "trapped": 1, "witch": 1, "revival": 1, "rakhsh": 1, "keykhosrow": 1, "mystery": 3, "sakurako": 10, "chefir": 1, "kosuke": 3, "sloth": 2, "kousuke": 1, "peanuts": 1, "genokraken": 1, "trinity": 1, "medians": 8, "penchick": 6, "chloe": 3, "desert": 3, "rabbit": 3, "buns": 3, "bbq": 1, "satay": 1, "modern": 1, "monument": 1, "universe": 3, "orangutan": 2, "approved": 1, "meximize": 1, "qed": 1, "true": 1, "oneness": 1, "challenge": 10, "everywhere": 6, "adventures": 8, "permuting": 1, "chess": 35, "endspeaker": 2, "stalin": 1, "bermart": 1, "action": 1, "figures": 3, "perpendicular": 1, "attribute": 1, "checks": 1, "binomial": 1, "coefficients": 2, "screens": 1, "interest": 2, "pits": 1, "skipping": 2, "billetes": 2, "mx": 2, "asesino": 2, "gerrymandering": 1, "kar": 1, "njamo": 1, "extreme": 4, "boss": 4, "thirsty": 1, "presentation": 2, "adjust": 2, "meaning": 2, "expected": 14, "dots": 3, "begins": 1, "speedbreaker": 4, "robin": 6, "hood": 5, "milky": 1, "defense": 4, "sheriff": 1, "rendez-vous": 1, "marian": 1, "de": 1, "et": 1, "mrs": 2, "robert": 1, "major": 2, "oak": 1, "helps": 1, "zhan": 1, "blender": 1, "bot": 3, "rock-paper-scissors": 4, "wolves": 3, "transmission": 5, "brothers": 2, "yunli": 3, "firefly": 1, "klee": 1, "duper": 1, "satyam": 1, "freya": 1, "legend": 4, "osu": 2, "hobby": 1, "dora": 4, "iris": 4, "eri": 1, "subtangle": 2, "alter": 1, "narek": 1, "lazy": 5, "portals": 4, "doors": 7, "piggy": 2, "101": 1, "optimizing": 1, "blue": 9, "court": 2, "rays": 5, "distanced": 1, "deterministic": 3, "loaded": 1, "ksyusha": 2, "photoshoot": 2, "gorillas": 2, "template": 3, "seating": 7, "ruler": 3, "slavic": 1, "eliminating": 2, "penacony": 1, "scale": 1, "lesson": 10, "let": 9, "cases": 1, "squaring": 1, "bouquet": 2, "fortnite": 1, "stardew": 1, "wooden": 6, "funny": 5, "hungry": 3, "diverse": 11, "dyn-scripted": 2, "xor-grid": 1, "med-imize": 1, "switches": 3, "ultra-meow": 1, "valuable": 4, "mistake": 2, "novice": 1, "monk": 1, "angry": 2, "pluses": 3, "reset": 2, "polygonal": 3, "mole": 2, "craft": 1, "bait": 1, "simultaneous": 2, "smithing": 1, "heartbeat": 1, "omnipotent": 1, "killer": 2, "multiset": 6, "fumo": 1, "temple": 2, "spinning": 2, "mine": 3, "basil": 1, "k-sort": 1, "ram": 2, "upload": 1, "non-academic": 1, "mathematical": 7, "stabilization": 4, "axis": 4, "d-function": 1, "capturing": 1, "trick": 6, "magnitude": 2, "array-value": 1, "dilemma": 